jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
/*
 * Copyright (c) 2021 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use of the Evaluation Software License Agreement
 * distributed along with this file within the software delivery package.
 *
 */

#include "Ifx_MHA_BridgeDrv_TLE9563.h"
#include "Ifx_MHA_BridgeDrv_Cfg.h"

#include "TLE9563_FuncLayer.h"

/* Macros to define the component ID */
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_SOURCEID     ((uint8)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_LIBRARYID    ((uint16)Ifx_ComponentID_LibraryID_mctrlHardwareAbstraction)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_MODULEID     (0U)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_COMPONENTID1 (4U)

#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_COMPONENTID2 ((uint8)Ifx_ComponentID_ComponentID2_eco)

/* Macros to define the component version */
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_MAJOR   (1U)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_MINOR   (2U)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_PATCH   (0U)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_T       (0U)
#define IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_REV     (0U)

/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MHA_BridgeDrv_TLE9563_componentID = {
    .sourceID = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_SOURCEID,
    .libraryID = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_LIBRARYID,
    .moduleID = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_MODULEID,
    .componentID1 = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MHA_BridgeDrv_TLE9563_componentVersion = {
    .major = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_MAJOR,
    .minor = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_MINOR,
    .patch = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_PATCH,
    .t = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_T,
    .rev = IFX_MHA_BRIDGEDRV_TLE9563_COMPONENTVERSION_REV
};
/* *INDENT-ON* */
/* Mask for unveiling all undervoltage status bits within the SUP_STAT register */
#define IFX_MHA_BRIDGEDRV_TLE9563_MASK_SUPSTAT_UV      (0x0D54u)

/* Mask for unveiling all overvoltage status bits within the SUP_STAT register */
#define IFX_MHA_BRIDGEDRV_TLE9563_MASK_SUPSTAT_OV      (0x02A2u)

/* Mask for unveiling all overvoltage status bits within the DSOV register */
#define IFX_MHA_BRIDGEDRV_TLE9563_MASK_DSOV_OV         (0x373Fu)

/* Mask for unveiling all overcurrent status bits within the DSOV register */
#define IFX_MHA_BRIDGEDRV_TLE9563_MASK_DSOV_OC         (0x4000u)

/* Mask for unveiling all overcurrent status bits within the HS_OL_OC_OT_STAT register */
#define IFX_MHA_BRIDGEDRV_TLE9563_MASK_HSOLOCOTSTAT_OC (0x0007u)

/* Number of bridge driver execution cycles until it can safely be assumed that an entire update of all status registers
 * has been performed by the LLD
 * Note: LLD ensures that the status on demand that is not older than the time period of 25 valid cyclic function
 *       calls assuming there is no other setter/clear/state-transition/watchdog requested during these time period.
 *       Potential requests up until this point are setCsaGain, WdgService and potential clrFault requests. This
 *       is why a higher value of 30 is chosen here. */
#define IFX_MHA_BRIDGEDRV_TLE9563_LLD_UPDATE_STAT_CYC  (30u)

/* Checks if any fault occurred and acts accordingly */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkFaultStatus(Ifx_MHA_BridgeDrv_TLE9563* self, bool const clearFault);

/* Check HW faults of bridge driver */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkHwFaults(bool* faultOverCurrent, bool* faultOverVoltage,
                                                           bool* faultUnderVoltage, bool const clearFault);

/* Check overcurrent status of TLE9563 via LLD */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkOvercurrent(void);

/* Check overvoltage status of TLE9563 via LLD */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkOvervoltage(void);

/* Check undervoltage status of TLE9563 via LLD */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkUndervoltage(void);

/* Bridge driver state machine implementation */
static inline void Ifx_MHA_BridgeDrv_TLE9563_stateMachine(Ifx_MHA_BridgeDrv_TLE9563* self);

/* Bridge driver in init state */
static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateInit(Ifx_MHA_BridgeDrv_TLE9563* self);

/* Bridge driver in on state */
static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateOn(Ifx_MHA_BridgeDrv_TLE9563* self, bool
                                                                                const clearFault);

/* Bridge driver in off state */
static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateOff(Ifx_MHA_BridgeDrv_TLE9563* self, bool
                                                                                 const clearFault);

/* Bridge driver in fault state */
static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateFault(Ifx_MHA_BridgeDrv_TLE9563* self,
                                                                                   bool const
                                                                                   clearFault);

/* Bridge driver queue handling of LLD requests */
static inline void Ifx_MHA_BridgeDrv_TLE9563_queueHandling(Ifx_MHA_BridgeDrv_TLE9563* self);

/* Mapping of queue requests to LLD function calls */
static inline uint8 Ifx_MHA_BridgeDrv_TLE9563_mapRequestToLLD(Ifx_MHA_BridgeDrv_TLE9563_requestsToLLD const request,
                                                              uint16 const                                  data);

/* Disable and enable the bridge driver */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_actionDisable(Ifx_MHA_BridgeDrv_TLE9563* self);
static inline bool Ifx_MHA_BridgeDrv_TLE9563_actionEnable(Ifx_MHA_BridgeDrv_TLE9563* self);

/* Send all available clear fault requests to the LLD */
static inline void Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsRequest(Ifx_MHA_BridgeDrv_TLE9563* self);

