jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
/* Check the summarized status of all available clear fault request */
static inline bool Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsCheck(Ifx_MHA_BridgeDrv_TLE9563* self);

/* polyspace-begin MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */

/* Function to get the component ID */
void Ifx_MHA_BridgeDrv_TLE9563_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MHA_BridgeDrv_TLE9563_componentID;
}


/* Function to get the component version */
void Ifx_MHA_BridgeDrv_TLE9563_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MHA_BridgeDrv_TLE9563_componentVersion;
}


void Ifx_MHA_BridgeDrv_TLE9563_execute(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Execute state machine */
    Ifx_MHA_BridgeDrv_TLE9563_stateMachine(self);

    /* Handle queue for LLD requests */
    Ifx_MHA_BridgeDrv_TLE9563_queueHandling(self);

    /* Check whether watchdog must be triggered */
    if (self->p_cycleCounter < self->p_wdTriggerThreshold)
    {
        /* No -> increment bridge driver cycle counter */
        self->p_cycleCounter++;
    }
    else
    {
        /* Yes -> set queue flags to set watchdog serve request */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqServeWD].requested = true;
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqServeWD].processed = false;

        /* Reset cycle counter */
        self->p_cycleCounter = 0u;
    }
}


void Ifx_MHA_BridgeDrv_TLE9563_init(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Status of LLD initialization */
    uint8           lldInitSuccess;

    /* Watchdog timer period */
    tWD_timerPeriod wdTimerPeriod;
    uint32          wdTimerPeriodUs;

    /* Initialize internal parameters to 0 */
    self->_Super_Ifx_MHA_BridgeDrv.p_enable     = false;
    self->_Super_Ifx_MHA_BridgeDrv.p_clearFault = false;
    self->p_status.overcurrent                  = false;
    self->p_status.overvoltage                  = false;
    self->p_status.undervoltage                 = false;
    self->p_status.spiFault                     = false;
    self->p_cycleCounter                        = 0u;

    /* Initialize TLE9563 LLD */
    lldInitSuccess = TLE9563_Init();

    /* Was the LLD initialization successful? */
    if (lldInitSuccess)
    {
        self->p_status.TLE9563InitFault = false;
        self->p_status.state            = Ifx_MHA_BridgeDrv_TLE9563_State_init;

        /* Initialize CSA gain */
        Ifx_MHA_BridgeDrv_TLE9563_setCsaGain(self,
            (Ifx_MHA_BridgeDrv_TLE9563_optionCsaGain)IFX_MHA_BRIDGEDRV_CFG_CSA_GAIN);
    }
    else
    {
        /* LLD initialization was not successful, so set non-recoverable fault flag */
        self->p_status.TLE9563InitFault = true;
        self->p_status.state            = Ifx_MHA_BridgeDrv_TLE9563_State_fault;
    }

    /* Get watchdog period from LLD and convert to us */
    wdTimerPeriod = (tWD_timerPeriod)TLE9563_getWdTimerPeriod();

    switch (wdTimerPeriod)
    {
        case WD_timerPeriod_10ms:
            wdTimerPeriodUs = 10000u;
            break;

        case WD_timerPeriod_20ms:
            wdTimerPeriodUs = 20000u;
            break;

        case WD_timerPeriod_50ms:
            wdTimerPeriodUs = 50000u;
            break;

        case WD_timerPeriod_100ms:
            wdTimerPeriodUs = 100000u;
            break;

        case WD_timerPeriod_200ms:
            wdTimerPeriodUs = 200000u;
            break;

        case WD_timerPeriod_500ms:
            wdTimerPeriodUs = 500000u;
            break;

        case WD_timerPeriod_1s:
            wdTimerPeriodUs = 1000000u;
            break;

        case WD_timerPeriod_10s:
            wdTimerPeriodUs = 10000000u;
            break;
    }

    /* Calculate the threshold at which the watchdog must be triggered */
    self->p_wdTriggerThreshold = wdTimerPeriodUs / IFX_MHA_BRIDGEDRV_CFG_EXECUTION_PERIOD_US;
}


/*************************************************************************************************
* Local functions declaration section
*************************************************************************************************/
static inline bool Ifx_MHA_BridgeDrv_TLE9563_faultStatus(bool swFaultStatus, uint32 hwFaultStatus, uint8
                                                         faultConfiguration, bool* faultStatusRet)
{
    /* Return value */
    bool faultOccured = false;

    /* 1.1 Check if this fault is configured as ENABLED */
    if (faultConfiguration >= IFX_MHA_BRIDGEDRV_FAULT_REACTION_ENABLE)
    {
        if (hwFaultStatus != 0u)
        {
            /* Set the fault information status bit */
            faultOccured = true;

            /* 1.2 Check if this fault is configured for REPORTING */
            if (faultConfiguration >= IFX_MHA_BRIDGEDRV_FAULT_REACTION_REPORT_ONLY)
            {
#if (IFX_MHA_BRIDGEDRV_CFG_ENABLE_FAULT_OUT == 1)

                /* Report fault source ONLY the 1st time it occurs */
                if (swFaultStatus == false)
                {
                    /* Report the fault through the user interface */
                    IFX_MHA_BRIDGEDRV_CFG_FAULT_OUT();
                }

#endif

                /* 1.3 Check if this fault is configured for REACTION */
                if (faultConfiguration >= IFX_MHA_BRIDGEDRV_FAULT_REACTION_REPORT_REACT)
                {
                    /* Set the fault status for reacting */
                    *faultStatusRet = true;
                }
            }
        }
    }

    return faultOccured;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkHwFaults(bool* faultOverCurrent, bool* faultOverVoltage,
                                                           bool* faultUnderVoltage, bool clearFault)
{
    /* Boolean output fault status */
    bool faultStatusRet;

