jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
    /* Local fault status */
    bool overCurrentStatus;
    bool overVoltageStatus;
    bool underVoltageStatus;

    /* Initialize output fault status to false */
    faultStatusRet = false;

    /* Check for overcurrent */
    overCurrentStatus = Ifx_MHA_BridgeDrv_TLE9563_checkOvercurrent();
    *faultOverCurrent = Ifx_MHA_BridgeDrv_TLE9563_faultStatus(*faultOverCurrent, overCurrentStatus,
        IFX_MHA_BRIDGEDRV_CFG_FAULT_REACTION_OVERCURRENT, &faultStatusRet);

    /* Check for overvoltage */
    overVoltageStatus = Ifx_MHA_BridgeDrv_TLE9563_checkOvervoltage();
    *faultOverVoltage = Ifx_MHA_BridgeDrv_TLE9563_faultStatus(*faultUnderVoltage, overVoltageStatus,
        IFX_MHA_BRIDGEDRV_CFG_FAULT_REACTION_OVERVOLT, &faultStatusRet);

    /* Check for undervoltage */
    underVoltageStatus = Ifx_MHA_BridgeDrv_TLE9563_checkUndervoltage();
    *faultUnderVoltage = Ifx_MHA_BridgeDrv_TLE9563_faultStatus(*faultUnderVoltage, underVoltageStatus,
        IFX_MHA_BRIDGEDRV_CFG_FAULT_REACTION_UNDERVOLT, &faultStatusRet);

    return faultStatusRet;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkFaultStatus(Ifx_MHA_BridgeDrv_TLE9563* self, bool const clearFault)
{
    /* TLE9563 SPI/CRC fail status */
    uint8 sifSpiCrcFail;

    /* Initialize boolean output fault status to false */
    bool  faultStatusRet = false;

    /* Save status of bridge driver faults in local variables */
    bool  faultOverCurrent  = self->p_status.overcurrent;
    bool  faultOverVoltage  = self->p_status.overvoltage;
    bool  faultUnderVoltage = self->p_status.undervoltage;

    /* Check if a clear fault was requested */
    if (clearFault == true)
    {
        /* Send clear request for all hardware faults via LLD */
        Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsRequest(self);

        /* Reset SPI fault status */
        self->p_status.spiFault = false;
    }

    /* Check HW faults */
    faultStatusRet = Ifx_MHA_BridgeDrv_TLE9563_checkHwFaults(&faultOverCurrent, &faultOverVoltage, &faultUnderVoltage,
        clearFault);

    /* Update bdrv faults from local variables */
    self->p_status.overcurrent  = faultOverCurrent;
    self->p_status.overvoltage  = faultOverVoltage;
    self->p_status.undervoltage = faultUnderVoltage;

    /* Get TLE9563 SPI/CRC fail status from the status information field */
    sifSpiCrcFail = TLE9563_getSifBitSpiCrcFail();

    /* Set SPI fault status in case TLE9563 has signalized an SPI/CRC error or if device driver signals an SPI receive
     * error */
    if ((sifSpiCrcFail != 0u)
        || (self->p_status.deviceDriverErrorLog == TLE9563_DEVICEDRIVER_ERRORLOG_SPI_RECEIVE_ERR))
    {
        self->p_status.spiFault = true;
    }

    /* Bridge Driver component should go to fail in case any of the voltage, current, SPI or Init faults is present */
    faultStatusRet = faultStatusRet
                     || self->p_status.spiFault
                     || self->p_status.TLE9563InitFault;

    /* Return the fault status */
    return faultStatusRet;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkOvercurrent(void)
{
    /* Local fault status */
    bool   overcurrentStatus;

    /* TLE9563 Drain-source overvoltage HBVOUT register value */
    uint16 dsov;

    /* TLE9563 High-Side Switch Status register value */
    uint16 hsOlOcOtStat;

    /* Get status registers of TLE9563 from the LLD */
    dsov         = TLE9563_getDsovStsReg();
    hsOlOcOtStat = TLE9563_getHsOlOcOtStsReg();

    /* Check for overcurrent */
    overcurrentStatus = ((dsov & IFX_MHA_BRIDGEDRV_TLE9563_MASK_DSOV_OC) > 0u);
    overcurrentStatus = overcurrentStatus | ((hsOlOcOtStat & IFX_MHA_BRIDGEDRV_TLE9563_MASK_HSOLOCOTSTAT_OC) > 0u);

    return overcurrentStatus;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkOvervoltage(void)
{
    /* Local fault status */
    bool   overvoltageStatus;

    /* TLE9563 Supply Voltage Fail Status register value */
    uint16 supStat;

    /* TLE9563 Drain-source overvoltage HBVOUT register value */
    uint16 dsov;

    /* Get status registers of TLE9563 from the LLD */
    supStat = TLE9563_getSupStsReg();
    dsov    = TLE9563_getDsovStsReg();

    /* Check for overvoltage */
    overvoltageStatus = ((supStat & IFX_MHA_BRIDGEDRV_TLE9563_MASK_SUPSTAT_OV) > 0u);
    overvoltageStatus = overvoltageStatus | ((dsov & IFX_MHA_BRIDGEDRV_TLE9563_MASK_DSOV_OV) > 0u);

    return overvoltageStatus;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_checkUndervoltage(void)
{
    /* Local fault status */
    bool   undervoltageStatus;

    /* TLE9563 Supply Voltage Fail Status register value */
    uint16 supStat;

    /* Get status register of TLE9563 from the LLD */
    supStat = TLE9563_getSupStsReg();

    /* Check for undervoltage */
    undervoltageStatus = ((supStat & IFX_MHA_BRIDGEDRV_TLE9563_MASK_SUPSTAT_UV) > 0u);

    return undervoltageStatus;
}


static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateInit(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Variable to store the next state */
    Ifx_MHA_BridgeDrv_TLE9563_State nextState;

    /* Check for undervoltage (initial readout of the status registers of TLE9563 is done in LLD init) */
    self->p_status.undervoltage = Ifx_MHA_BridgeDrv_TLE9563_checkUndervoltage();

    /* Undervoltage pending, i.e. charge pump has not ramped up yet? */
    if (!self->p_status.undervoltage)
    {
        /* No, go to state OFF */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;
    }
    else
    {
        /* Yes -> clear supply status register until no more undervoltage fault is detected */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts].requested = true;

        if (self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts].processed)
        {
            self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts].processed = false;
        }
    }

    /* Have all status register of TLE9563 already been updated at least once after the clear request? */
    if (self->p_cycleCounter > IFX_MHA_BRIDGEDRV_TLE9563_LLD_UPDATE_STAT_CYC)
    {
        /* Charge pump is not ramping up, go to state FAULT via state OFF */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;
    }
    else
    {
        /* Stay in INIT as long as charge pump has not ramped up yet */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_init;
    }

    return nextState;
}


