jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateOff(Ifx_MHA_BridgeDrv_TLE9563* self, bool
                                                                                 const clearFault)
{
    /* Variable to store the next state */
    Ifx_MHA_BridgeDrv_TLE9563_State nextState;

    /* Variable to store fault status of bridge driver */
    bool                            faultStatus;

    /* Flag whether the enable action has finished */
    bool                            finished;

    /* Check fault status of bridge driver */
    faultStatus = Ifx_MHA_BridgeDrv_TLE9563_checkFaultStatus(self, clearFault);

    /* check condition for T1 */
    if ((self->_Super_Ifx_MHA_BridgeDrv.p_enable == true)
        && (faultStatus == false))
    {
        /* do Action BridgeDriver ENABLED */
        finished = Ifx_MHA_BridgeDrv_TLE9563_actionEnable(self);

        if (finished)
        {
            /* do state transition to ON */
            nextState = Ifx_MHA_BridgeDrv_TLE9563_State_on;
        }
        else
        {
            /* stay in OFF state */
            nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;
        }
    }

    /* check condition for T2 */
    else if (faultStatus == true)
    {
        /* do state transition to FAULT */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_fault;
    }
    else
    {
        /* stay in OFF state */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;
    }

    return nextState;
}


static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateOn(Ifx_MHA_BridgeDrv_TLE9563* self, bool
                                                                                const clearFault)
{
    /* Variable to store the next state */
    Ifx_MHA_BridgeDrv_TLE9563_State nextState;

    /* Variable to store fault status of bridge driver */
    bool                            faultStatus;

    /* Flag whether the disable action has finished */
    bool                            finished;

    /* Check fault status of bridge driver */
    faultStatus = Ifx_MHA_BridgeDrv_TLE9563_checkFaultStatus(self, clearFault);

    /* check condition for T2 */
    if (faultStatus == true)
    {
        /* do state transition to FAULT */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_fault;
    }

    /* check condition for T1 */
    else if (self->_Super_Ifx_MHA_BridgeDrv.p_enable == false)
    {
        /* do Action BridgeDriver DISABLED */
        finished = Ifx_MHA_BridgeDrv_TLE9563_actionDisable(self);

        if (finished)
        {
            /* do state transition to OFF */
            nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;
        }
        else
        {
            nextState = Ifx_MHA_BridgeDrv_TLE9563_State_on;
        }
    }
    else
    {
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_on;
    }

    return nextState;
}


static inline Ifx_MHA_BridgeDrv_TLE9563_State Ifx_MHA_BridgeDrv_TLE9563_stateFault(Ifx_MHA_BridgeDrv_TLE9563* self,
                                                                                   bool const
                                                                                   clearFault)
{
    /* Variable to store the next state */
    Ifx_MHA_BridgeDrv_TLE9563_State nextState;

    /* Variable to store fault status of bridge driver */
    bool                            faultStatus;

    /* Check fault status of bridge driver */
    faultStatus = Ifx_MHA_BridgeDrv_TLE9563_checkFaultStatus(self, clearFault);

    /* check condition for T1 */
    if ((self->_Super_Ifx_MHA_BridgeDrv.p_enable == true)
        && (faultStatus == false))
    {
        /* do state transition to ON */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_on;

        /* do Action BridgeDriver ENABLED */
        Ifx_MHA_BridgeDrv_TLE9563_actionEnable(self);
    }
    else if ((self->_Super_Ifx_MHA_BridgeDrv.p_enable == false)
             && (faultStatus == false))
    {
        /* do state transition to OFF */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_off;

        /* do Action BridgeDriver DISABLED */
        Ifx_MHA_BridgeDrv_TLE9563_actionDisable(self);
    }
    else
    {
        /* stay in FAULT */
        nextState = Ifx_MHA_BridgeDrv_TLE9563_State_fault;
    }

    return nextState;
}


static inline void Ifx_MHA_BridgeDrv_TLE9563_stateMachine(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Variable to store the previous state */
    Ifx_MHA_BridgeDrv_TLE9563_State previousState = self->p_status.state;

    /* Variable to store the next state */
    Ifx_MHA_BridgeDrv_TLE9563_State nextState;

    /* Variable to store clear fault */
    bool                            clearFault = self->_Super_Ifx_MHA_BridgeDrv.p_clearFault;

    switch (previousState)
    {
        /* Bridge driver is in init state */
        case Ifx_MHA_BridgeDrv_TLE9563_State_init:
            nextState = Ifx_MHA_BridgeDrv_TLE9563_stateInit(self);
            break;

        /* Bridge driver is in off state */
        case Ifx_MHA_BridgeDrv_TLE9563_State_off:
            nextState = Ifx_MHA_BridgeDrv_TLE9563_stateOff(self, clearFault);
            break;

        /* Bridge driver is in on state */
        case Ifx_MHA_BridgeDrv_TLE9563_State_on:
            nextState = Ifx_MHA_BridgeDrv_TLE9563_stateOn(self, clearFault);
            break;

        /* Bridge driver is in fault state (Ifx_MHA_BridgeDrv_TLE9563_State_fault, default) */
        default:
            nextState = Ifx_MHA_BridgeDrv_TLE9563_stateFault(self, clearFault);
            break;
    }

    /* Update state and reset clear fault */
    self->p_status.state = nextState;

    /* All clear fault requests have been processed by the LLD? */
    if (Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsCheck(self))
    {
        /* Yes -> clear fault request has finished */
        self->_Super_Ifx_MHA_BridgeDrv.p_clearFault = false;
    }
}


static inline void Ifx_MHA_BridgeDrv_TLE9563_queueHandling(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Temporary variable to hold the request with the highest priority */
    Ifx_MHA_BridgeDrv_TLE9563_requestsToLLD requestLLD;

