jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
    /* Counter variable */
    uint32                                  i;

    /* Index of the request with the highest priority */
    uint32                                  requestHighestPriority;

    /* Status returned by the LLD */
    uint8                                   success;

    /* No pending request has been passed on successfully to the LLD yet */
    success = 0u;

    /* Find the pending request with the highest priority */
    for (i = 0u; i < Ifx_MHA_BridgeDrv_TLE9563_reqNumTotal; i++)
    {
        if (self->p_queueElement[i].requested
            && (!self->p_queueElement[i].processed))
        {
            /* Store the number of the request with the highest priority */
            requestHighestPriority = i;

            /* Convert the request number to the corresponding enum */
            requestLLD = (Ifx_MHA_BridgeDrv_TLE9563_requestsToLLD)requestHighestPriority;

            /* Pass the request on to the LLD */
            success = Ifx_MHA_BridgeDrv_TLE9563_mapRequestToLLD(requestLLD, self->p_queueElement[i].data);

            /* Only one request can be passed on per cyclic task call */
            break;
        }
    }

    /* Call TLE9563 LLD cyclic function to process any wd/set/clear requests and to update status registers */
    self->p_status.deviceDriverErrorLog = TLE9563_deviceDriverCyclicTask();

    /* Did the LLD successfully start processing a request? */
    if (success
        && (self->p_status.deviceDriverErrorLog == TLE9563_DEVICEDRIVER_ERRORLOG_STARTED))
    {
        /* Yes -> update the queue element with the highest priority */
        self->p_queueElement[requestHighestPriority].processed = true;
    }
}


static inline uint8 Ifx_MHA_BridgeDrv_TLE9563_mapRequestToLLD(Ifx_MHA_BridgeDrv_TLE9563_requestsToLLD const request,
                                                              uint16 const                                  data)
{
    /* Status returned from LLD */
    uint8 success;

    /* Pass the request to the correct LLD function */
    switch (request)
    {
        case Ifx_MHA_BridgeDrv_TLE9563_reqServeWD:
            {
                success = TLE9563_serveWatchdog();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts:
            {
                success = TLE9563_clrSupSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrThermSts:
            {
                success = TLE9563_clrThermSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrDevSts:
            {
                success = TLE9563_clrDevSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrBusSts:
            {
                success = TLE9563_clrBusSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrWkSts:
            {
                success = TLE9563_clrWkSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrHsOlOcOtSts:
            {
                success = TLE9563_clrHsOlOcOtSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrDsovSts:
            {
                success = TLE9563_clrDsovSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqClrSwkSts:
            {
                success = TLE9563_clrSwkSts();
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx:
            {
                success = TLE9563_setAllHbx((tBDRV_setAllHbx)data);
            } break;

        case Ifx_MHA_BridgeDrv_TLE9563_reqSetCsaGain:
            {
                success = TLE9563_setCsaGain((tCSA_gain)data);
            } break;

        default:
            {
                success = 0u;
            } break;
    }

    return success;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_actionDisable(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* The return value represents whether the action has finished */
    bool finished;

    /* Bridge Driver not disabled yet */
    finished = false;

    /* LLD request already processed? */
    if (self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].processed)
    {
        /* Yes -> bridge driver can go to state off */
        finished = true;

        /* Reset queue flags */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].requested = false;
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].processed = false;
    }
    else
    {
        /* No -> send set request to LLD */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].requested = true;
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].data      =
            (uint16)BDRV_setAllHbx_passiveOff_afwEn_pwmInact;
    }

    return finished;
}


static inline bool Ifx_MHA_BridgeDrv_TLE9563_actionEnable(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* The return value represents whether the action has finished */
    bool finished;

    /* Bridge Driver not disabled yet */
    finished = false;

    /* LLD request already processed? */
    if (self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].processed)
    {
        /* Yes -> bridge driver can go to state off */
        finished = true;

        /* Reset queue flags */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].requested = false;
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].processed = false;
    }
    else
    {
        /* No -> set request to LLD */
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].requested = true;
        self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqSetAllHbx].data      =
            (uint16)BDRV_setAllHbx_hsOn_afwDis_pwmAct;
    }

    return finished;
}


static inline void Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsRequest(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Request clear fault from LLD for every status register */
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts].requested      = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrThermSts].requested    = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrDevSts].requested      = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrBusSts].requested      = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrWkSts].requested       = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrHsOlOcOtSts].requested = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrDsovSts].requested     = true;
    self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSwkSts].requested      = true;
}


