jassony/infineon2b6/MHA/src/Ifx_MHA_BridgeDrv_TLE9563.c
static inline bool Ifx_MHA_BridgeDrv_TLE9563_clearAllFaultsCheck(Ifx_MHA_BridgeDrv_TLE9563* self)
{
    /* Status flag whether all clear fault steps are finished */
    bool clearFaultsFinished;

    /* Status flag whether all clear fault requests have been processed by the LLD */
    bool clearFaultsProcessed;
    clearFaultsFinished = false;

    if (self->p_clrFaultsStep == Ifx_MHA_BridgeDrv_TLE9563_clrFaultsWaitProc)
    {
        /* Step 1: Check all clear requests in the queue */
        clearFaultsProcessed  = true;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSupSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrThermSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrDevSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrBusSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrWkSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrHsOlOcOtSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrDsovSts].processed;
        clearFaultsProcessed &= self->p_queueElement[Ifx_MHA_BridgeDrv_TLE9563_reqClrSwkSts].processed;

        if (clearFaultsProcessed)
        {
            /* Goto next step */
            self->p_clrFaultsStep = Ifx_MHA_BridgeDrv_TLE9563_clrFaultsInitCounter;
        }
    }

    if (self->p_clrFaultsStep == Ifx_MHA_BridgeDrv_TLE9563_clrFaultsInitCounter)
    {
        /* Step 2: Initialize counter */
        self->p_clrFaultsCounter = 0u;

        /* Goto next step */
        self->p_clrFaultsStep = Ifx_MHA_BridgeDrv_TLE9563_clrFaultsWaitCounter;
    }

    if (self->p_clrFaultsStep == Ifx_MHA_BridgeDrv_TLE9563_clrFaultsWaitCounter)
    {
        /* Step 3: Wait for update of all status registers */
        if (self->p_clrFaultsCounter < IFX_MHA_BRIDGEDRV_TLE9563_LLD_UPDATE_STAT_CYC)
        {
            self->p_clrFaultsCounter++;
        }
        else
        {
            clearFaultsFinished = true;
        }
    }

    return clearFaultsFinished;
}


/* polyspace-end MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */
